# **Data analysis**


Here we are using India covid dataset which is in form of csv file 

(data source : https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results)

**Load your Data**

Now first step is to load the data  which contains two files 

1. athlete_events.csv 

2. noc_regions.csv  

For this we need to use pandas library as follows

In [2]:
#import the library first

import pandas as pd

data = pd.read_csv('athlete_events.csv')

tdata = pd.read_csv('noc_regions.csv')

#display the initial contents of both the datasets

**Review your Data** 

Now we will look at the contents of the data in details like number of columns, data types etc

In [3]:

data.head()   #this will display first 5 entries ( rows ) of your dataset

   ID                      Name  ...                             Event  Medal
0   1                 A Dijiang  ...       Basketball Men's Basketball    NaN
1   2                  A Lamusi  ...      Judo Men's Extra-Lightweight    NaN
2   3       Gunnar Nielsen Aaby  ...           Football Men's Football    NaN
3   4      Edgar Lindenau Aabye  ...       Tug-Of-War Men's Tug-Of-War   Gold
4   5  Christine Jacoba Aaftink  ...  Speed Skating Women's 500 metres    NaN

[5 rows x 15 columns]

In [4]:
tdata.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [6]:
tdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 230 entries, 0 to 229
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NOC     230 non-null    object
 1   region  227 non-null    object
 2   notes   21 non-null     object
dtypes: object(3)
memory usage: 5.5+ KB

**Preprocess your data**

Now its time to preprocess your data where actual challenge is!!

***Missing values- Part 1*** 

---



If your dataset contains 'blank' spaces, pandas will recognize it as missing values

In [7]:

print(tdata.isnull())

'''
as shown in result below, all blanks are represented as NaN values (missing values) and using .isnull() function , 
pandas specifies it as a null value that is wherever it is a NaN, its result is 'True'
'''

       NOC  region  notes
0    False   False   True
1    False   False  False
2    False   False   True
3    False   False   True
4    False   False   True
..     ...     ...    ...
225  False   False   True
226  False   False  False
227  False   False  False
228  False   False   True
229  False   False   True

[230 rows x 3 columns]

"\nas shown in result below, all blanks are represented as NaN values (missing values) and using .isnull() function , \npandas specifies it as a null value that is wherever it is a NaN, its result is 'True'\n"

***Missing values- Part 2***

---

In [8]:

print(data.isnull())

           ID   Name    Sex    Age  Height  ...  Season   City  Sport  Event  Medal
0       False  False  False  False   False  ...   False  False  False  False   True
1       False  False  False  False   False  ...   False  False  False  False   True
2       False  False  False  False    True  ...   False  False  False  False   True
3       False  False  False  False    True  ...   False  False  False  False  False
4       False  False  False  False   False  ...   False  False  False  False   True
...       ...    ...    ...    ...     ...  ...     ...    ...    ...    ...    ...
271111  False  False  False  False   False  ...   False  False  False  False   True
271112  False  False  False  False   False  ...   False  False  False  False   True
271113  False  False  False  False   False  ...   False  False  False  False   True
271114  False  False  False  False   False  ...   False  False  False  False   True
271115  False  False  False  False   False  ...   False  False  False  False   True

[271116 rows x 15 columns]

***Great!! finally all of the different formats are recognized as missing values!!***  

This is one of the critical aspects of data analysis in data science

***Summarizing Missing Values***

---



now next step is to summarize the missing values 

Lets say we want to observe the total number of missing values for each feature (column name)

In [9]:
print (data.isnull().sum())   # it will give us the total number of missing values in each individual column

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

In [10]:
#lets print it for our previous dataset 
print (tdata.isnull().sum())

NOC         0
region      3
notes     209
dtype: int64

In [11]:
# suppose I want to check is there any missing value in entire dataset (even if there is one missing, it will give a True output)

print (tdata.isnull().values.any())     #since both datasets contains missing values, it will be 'True' for both datasets

print (data.isnull().values.any())

True
True

In [12]:
# now I want to sum all the missing values ( how many total missing values in a dataset?)

print (tdata.isnull().sum().sum())      #this will give the sum of all missing values present in all columns together in entire dataset

print (data.isnull().sum().sum())

212
363853

**Great!! We have summarized our missing values !!**

In [13]:
#we can check that using .info() as follows 
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

***Filling Missing Values***

sometimes its not advisible to remove the rows containing missing values since they might contain valuable data in other columns. In this case, we need to fill these missing values by using certain values instead of directly removing those rows or columns 


There are many ways to fill the missing values, but we will discuss the approach which best suits for our dataset


To do this , we will use below code for those respective columns where missing values are present in testing ('tdata') dataset

In [14]:
data['Height'].fillna(data['Height'].mean(), inplace=True) #fill missing values 
data['Weight'].fillna(data['Weight'].mean(), inplace=True) #fill missing values 
data['Age'].fillna(data['Age'].mean(), inplace=True) #fill missing values

**Great!! We have replaced/filled our missing values !!**

**Analysis on Preprocessed data** 

Lets do analysis on this preprocessed data now

Here we will find answers of some questions which we should able to answer as a data analyst/data scientist/researcher while working in data science domain

***Question 1***

How many Teams and cities are involved?

***solution***

In [15]:
data['Team'].nunique()   #here we have total 1184 teams

1184

In [16]:
data['City'].nunique()   #here we have total 42

42

***Question 2***

What are top five States with the most number of confirmed cases?

***solution***

In [17]:
df1= data.sort_values(by ='Height', ascending=False)   #here we are sorting the values in Height column 
df1.head(5)

            ID                   Name  ...                        Event   Medal
265040  132627               Yao Ming  ...  Basketball Men's Basketball     NaN
265041  132627               Yao Ming  ...  Basketball Men's Basketball     NaN
265042  132627               Yao Ming  ...  Basketball Men's Basketball     NaN
32376    16639   Tommy Loren Burleson  ...  Basketball Men's Basketball  Silver
207375  104059  Arvydas Romas Sabonis  ...  Basketball Men's Basketball  Bronze

[5 rows x 15 columns]